[
"Rukun / Fardhu Mandi Ada 3 Yakni:*\n1. Niat\nAdapun niat mandi wajib atau hadats besar sebagai berikut :\nنَوَيْتُ الْغُسْلَ لِرَفْعِ الْحَدَثِ اْلاَكْبَرِ فَرْضًا ِللهِ تَعَالَى\nLatinnya : Nawaitul Ghusla Liraf'il Hadatsil Akbari Fardhan Lillahi Ta’aala\nArtinya : “Aku berniat mandi wajib untuk menghilangkan hadats besar fardhu karena Allah ta’aala”\n\n1. Hadats besar karena keluar sperma\nBagi laki-laki yang mengeluarkan sperma baik karena bersetubuh atau berhubungan suami istri dan sebagainya maka setelah itu harus mandi wajib atau mandi junub. Adapun niat doa mandi wajib setelah berhubungan suami istri sebagai berikut.\nنَوَيْتُ الْغُسْلَ لِرَفْعِ الْحَدَثِ الْأَكْبَرِ مِنَ الْجِنَابَةِ فَرْضًا لِلهِ تَعَالَى\nLatinnya : Nawaitul Ghusla Liraf'il Hadatsil Akbari Minal Jinabati Fardhan Lillahi Ta’aala\nArtinya : Saya niat mandi junub untuk menghilangkan hadats besar junub karena Allah.\n\n2. Niat mandi wajib haid\nBagi wanita mengalami haid tiap bulan merupakan sesuatu yang wajar. Namun setelah itu maka tentunya harus mandi wajib atau hadats besar dengan doa mandi setelah haid.\nNiat mandi wajib setelah haid sebagai berikut.\nنَوَيْتُ الْغُسْلَ لِرَفْعِ حَدَثِ الْأَكْبَرِ مِنَ الْحَيْضِ فَرْضًا لِلهِ تَعَالَى\nLatinnya : Nawaitul Ghusla Liraf'il Hadatsil Akbari Minal Haidi Fardhan Lillahi Ta’aala\nArtinya : Saya niat mandi junub untuk menghilangkan hadats besar haid karena Allah Ta’ala.\n\n3. Niat doa mandi wajib nifas\n\nنَوَيْتُ الْغُسْلَ لِرَفْعِ حَدَثِ الْأَكْبَرِ مِنَ النِّفَاسِ فَرْضًا لِلهِ تَعَالَى\n\nLatinnya : Nawaitul Ghusla Liraf'il Hadatsil Akbari Minannifasi Fardhan Lillahi Ta’aala\nArtinya: Saya niat mandi junub untuk menghilangkan hadats besar nifas karena Allah Ta’ala.\n\n4. Niat mandi wajib setelah melahirkan (wiladah)\n\nنَوَيْتُ الْغُسْلَ لِرَفْعِ حَدَثِ الْأَكْبَرِ مِنَ الْوِلَادَةِ فَرْضًا لِلهِ تَعَالَى\n\nLatinnya : Nawaitul Ghusla Liraf'il Hadatsil Akbari Minal Wiladahti Fardhan Lillahi Ta’aala\nArtinya: Saya niat mandi junub untuk menghilangkan hadats besar melahirkan karena Allah Ta’ala.\n\n2. Menghilangkan najis pada badan\n\n3. Mengalirkan air ke seluruh rambut dan kulit badan"
]